# What is Pandas?
python library for data manipulation and analysis

In [8]:
import pandas as pd
data_frame = pd.read_csv('data/friend_list.csv')

In [9]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# What is DataFrame?
dataframe is a 2-dimensional labeled data structure with columns

In [32]:
data_frame.head()

    name  age        job
0   John   20    STUDENT
1  Jenny   30  DEVELOPER
2   Nate   30    TEACHER
3  Julia   40    DENTIST
4  Brian   45    MANAGER

In [33]:
data_frame.describe()

             age
count   6.000000
mean   31.666667
std     9.309493
min    20.000000
25%    26.250000
50%    30.000000
75%    37.500000
max    45.000000

# What is Series?
Every single column in dataframe is series

In [22]:
#type(data_frame.name)
#type(data_frame['age'])
type(data_frame.job)

pandas.core.series.Series

In [26]:
data_frame.job = data_frame.job.str.upper()

In [27]:
data_frame.head()

    name  age        job
0   John   20    STUDENT
1  Jenny   30  DEVELOPER
2   Nate   30    TEACHER
3  Julia   40    DENTIST
4  Brian   45    MANAGER

Series is just wrapper for python list

In [42]:
s1 = pd.core.series.Series(['one', 'two', 'three'])

In [43]:
s2 = pd.core.series.Series([1, 2, 3])

In [44]:
pd.DataFrame(data=dict(word=s1, num=s2))

   num   word
0    1    one
1    2    two
2    3  three

# Why Pandas?

Very similar to Excel spreadsheet view,  
support various functions for data manipulation and analysis.  
Fast based on Numpy.  
Easy to manipulate data for your purpose